README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-13 Mi 13:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DustVoice's WSL from scratch</title>
<meta name="author" content="DustVoice" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">DustVoice&rsquo;s WSL from scratch</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc25b37b">1. Prerequisites</a>
<ul>
<li><a href="#org15149ca">1.1. Enable the Windows Feature</a></li>
<li><a href="#orgfa47a19">1.2. Installing / Updating WSL</a>
<ul>
<li><a href="#org0de4c76">1.2.1. Just Works<sup>TM</sup>?</a></li>
</ul>
</li>
<li><a href="#org47c811f">1.3. Installing ArchWSL</a>
<ul>
<li><a href="#org825b6bd">1.3.1. Just Works<sup>TM</sup> v2</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This document is an attempt at providing a guide for my <a href="https://learn.microsoft.com/en-us/windows/wsl/install">WSL 2</a> setup based on <a href="https://archlinux.org">Arch Linux</a>, or rather <a href="https://github.com/yuk7/ArchWSL">ArchWSL</a>.
</p>

<p>
It is mainly intended as a set of personal mental crutches, so the following disclaimer applies
</p>

<blockquote>
<p>
[!CAUTION]
Your mileage may vary!
</p>

<p>
Not for the faint of heart!
</p>

<p>
Be wary of utter steaming hot garbage!
</p>

<p>
Proceed with caution and at your own risk!
</p>
</blockquote>
<div id="outline-container-orgc25b37b" class="outline-2">
<h2 id="orgc25b37b"><span class="section-number-2">1.</span> Prerequisites</h2>
<div class="outline-text-2" id="text-1">
<p>
Before we can get started, we need to do a bit of configuration outside and inside the WSL environment to enable the rest of the guide
</p>
</div>
<div id="outline-container-org15149ca" class="outline-3">
<h3 id="org15149ca"><span class="section-number-3">1.1.</span> Enable the Windows Feature</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
[!IMPORTANT]
It seems as if you don&rsquo;t longer need to manually enable the Windows Feature manually/yourself, as <a href="https://devblogs.microsoft.com/commandline/install-wsl-with-a-single-command-now-available-in-windows-10-version-2004-and-higher/?commentid=5587#comment-5587">this comment</a> suggests.
</p>

<p>
I&rsquo;ll still leave the following info intact, because we all know what beautiful, reliable and stable pieces of software <i>Microsoft Windows</i> and the <i>Microsoft Store</i> are _{sarcasm off} &#x2026;
</p>
</blockquote>

<p>
You might want to enable the <code>Windows Subsystem for Linux</code> Windows feature.
You can either try opening your <i>Windows Search</i> and searching for <code>Turn Windows features on or off</code>, or you can dig your way through the <i>Control Panel</i>.
</p>

<blockquote>
<p>
[!TIP]
For <a href="https://github.com/microsoft/wslg">WSLg</a> to work properly, you need to make sure you&rsquo;re running the Windows 11, or the minimum required version of Windows 10 <i>(Version 2004 or higher / Build 19041 or higher)</i>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgfa47a19" class="outline-3">
<h3 id="orgfa47a19"><span class="section-number-3">1.2.</span> Installing / Updating WSL</h3>
<div class="outline-text-3" id="text-1-2">
<blockquote>
<p>
[!NOTE]
Microsoft recommends installing the Distro from the Microsoft store, but also specifies the commands below.
</p>

<p>
In my experience, depending on your installation, or whether your Microsoft Store has shot itself in the foot yet or not, the installation is a little incoherent.
</p>

<p>
When in doubt, use the <a href="https://learn.microsoft.com/en-us/windows/wsl/install">official Microsoft installation documentation</a>.
</p>
</blockquote>

<p>
To install WSL from a <code>cmd</code> or <code>PowerShell</code> <i>with elevated privileges</i> run <code>wsl --install -d Ubuntu</code>, or if you&rsquo;ve already installed WSL in the past, <i>also from an elevated prompt</i>, run <code>wsl --update</code>.
</p>
</div>
<div id="outline-container-org0de4c76" class="outline-4">
<h4 id="org0de4c76"><span class="section-number-4">1.2.1.</span> Just Works<sup>TM</sup>?</h4>
<div class="outline-text-4" id="text-1-2-1">
<blockquote>
<p>
[!IMPORTANT]
This should only be neccessary if your Windows is locked down, the Microsoft Store is disabled, or similar.
</p>
</blockquote>

<p>
As it turns out, if you&rsquo;re in a pretty restricting corporate setting, the Windows environment is somewhat &#x2026; botched.
The only way I was able to install WSL successfully is by using the manual installation method.
</p>

<p>
This includes
</p>
<ol class="org-ol">
<li>Downloading the <a href="https://github.com/microsoft/WSL/releases">latest WSL release</a> (the <code>.msixbundle</code>)</li>
<li>Installing it by running</li>
</ol>
<div class="org-src-container">
<pre class="src src-powershell">Add-AppxPackage Microsoft.WSL_&lt;version&gt;_&lt;arch&gt;.msixbundle
</pre>
</div>
<ol class="org-ol">
<li>Proceeding with the <a href="#org47c811f">Installing ArchWSL</a> step.</li>
</ol>

<blockquote>
<p>
[!NOTE]
If <code>wsl --update</code> also doesn&rsquo;t work, in addition to <code>wsl --install [...]</code>, you might need to repeat the aforementioned process for updating WSL.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org47c811f" class="outline-3">
<h3 id="org47c811f"><span class="section-number-3">1.3.</span> Installing ArchWSL</h3>
<div class="outline-text-3" id="text-1-3">
<blockquote>
<p>
[!NOTE]
When in doubt, use the <a href="https://wsldl-pg.github.io/ArchW-docs/">ArchWSL documentation</a>.
</p>
</blockquote>

<p>
For me, the simplest procedure was to
</p>

<ol class="org-ol">
<li>Download the latest <code>Arch.zip</code> file from the <a href="https://github.com/yuk7/ArchWSL/releases/latest">release page</a></li>

<li>Extract it to a folder where your user has unrestricted read and write permissions, so ideally stay away from <code>Program Files</code>, etc.</li>

<li>Run the included <code>Arch.exe</code></li>

<li><p>
Change the root password
</p>

<div class="org-src-container">
<pre class="src src-sh">passwd
</pre>
</div></li>

<li><p>
Add the <code>wheel</code> group to the allowed <code>sudo</code> users
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #eed49f;">echo</span> <span style="color: #a6da95;">"%wheel ALL=(ALL) ALL"</span> &gt; /etc/sudoers.d/wheel
</pre>
</div></li>

<li><p>
Add a new user and add it to the <code>wheel</code> group
</p>

<div class="org-src-container">
<pre class="src src-sh">useradd -m -G wheel -s /bin/bash &lt;username&gt;
</pre>
</div></li>

<li><p>
Change the new user&rsquo;s password
</p>

<div class="org-src-container">
<pre class="src src-sh">passwd &lt;username&gt;
</pre>
</div></li>

<li><p>
Exit the WSL environment
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c6a0f6;">exit</span>
</pre>
</div></li>

<li><p>
Set the new user as the default one
</p>

<div class="org-src-container">
<pre class="src src-powershell">Arch.exe config --default-user &lt;username&gt;
</pre>
</div></li>

<li><p>
Rebooting or restarting <code>LxssManager</code> with
</p>

<div class="org-src-container">
<pre class="src src-powershell">net stop lxssmanager
</pre>
</div>

<p>
and
</p>

<div class="org-src-container">
<pre class="src src-powershell">net start lxssmanager
</pre>
</div></li>

<li><p>
After that reenter WSL with
</p>
<div class="org-src-container">
<pre class="src src-powershell">Arch.exe
</pre>
</div></li>

<li><p>
Setup the <code>pacman</code> keyring
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #eed49f;">sudo</span> pacman-key --init
<span style="color: #eed49f;">sudo</span> pacman-key --populate
<span style="color: #eed49f;">sudo</span> pacman -Sy archlinux-keyring
</pre>
</div></li>

<li><p>
Update the base system
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #eed49f;">sudo</span> pacman -Su
</pre>
</div></li>
</ol>

<blockquote>
<p>
[!TIP]
You can update your mirrorlist with your nearest mirrors.
</p>

<ol class="org-ol">
<li>It is best practice to backup your original mirrorlist.</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #eed49f;">sudo</span> <span style="color: #eed49f;">cp</span> /etc/pacman.d/mirrorlist /etc/pacman.d/mirrorlist.old
</pre>
</div>
<ol class="org-ol">
<li>Generate a mirrorlist with the 5 best mirrors and save it to <code>/etc/pacman.d/mirrorlist</code></li>
</ol>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #eed49f;">curl</span> -s <span style="color: #a6da95;">"https://archlinux.org/mirrorlist/?country=DE&amp;protocol=http&amp;protocol=https&amp;ip_version=4&amp;use_mirror_status=on"</span>  | sed -e <span style="color: #a6da95;">'s/^#Server/Server/'</span> -e <span style="color: #a6da95;">'/^#/d'</span> | rankmirrors -n <span style="color: #f5a97f;">5</span> - | <span style="color: #eed49f;">sudo</span> tee /etc/pacman.d/mirrorlist
</pre>
</div>
</blockquote>
</div>
<div id="outline-container-org825b6bd" class="outline-4">
<h4 id="org825b6bd"><span class="section-number-4">1.3.1.</span> Just Works<sup>TM</sup> v2</h4>
<div class="outline-text-4" id="text-1-3-1">
<blockquote>
<p>
[!IMPORTANT]
This should only be neccessary if you&rsquo;re behind a (corporate) http proxy
</p>
</blockquote>

<p>
As I&rsquo;m sitting behind a corporate http proxy, I had no access to the internet.
This can be confirmed by running
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orge2f81aa"><span style="color: #eed49f;">curl</span> https://archlinux.org
</pre>
</div>

<p>
To make WSL proxy-aware, I needed to
</p>

<ol class="org-ol">
<li><p>
Populate my <code>~/.bashrc</code> with
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ed8796;">export</span> <span style="color: #cad3f5;">http_proxy</span>=http://&lt;hostname&gt;:&lt;port&gt;
<span style="color: #ed8796;">export</span> <span style="color: #cad3f5;">https_proxy</span>=$<span style="color: #cad3f5;">http_proxy</span>
<span style="color: #ed8796;">export</span> <span style="color: #cad3f5;">ftp_proxy</span>=$<span style="color: #cad3f5;">http_proxy</span>
</pre>
</div></li>

<li><p>
Source it with
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ed8796;">source</span> ~/.bashrc
</pre>
</div></li>

<li><p>
Allow <code>sudo</code> to pass these environment variables through by populating <code>/etc/sudoers.d/proxy</code> with
</p>

<div class="org-src-container">
<pre class="src src-txt">Defaults env_keep += "http_proxy https_proxy ftp_proxy"
</pre>
</div></li>
</ol>

<p>
Rerunning the <a href="#orge2f81aa"><code>curl</code> command</a> should now produce a response and <code>pacman</code> get updated and upgraded
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #eed49f;">sudo</span> pacman -Syyuu
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #ed8796;">(</span><span style="color: #c6a0f6;">setq</span> test <span style="color: #a6da95;">"Hello"</span>
      st<span style="color: #ed8796;">)</span>
<span style="color: #ed8796;">(</span><span style="color: #f5a97f;">message</span> test<span style="color: #ed8796;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DustVoice</p>
<p class="date">Created: 2024-11-13 Mi 13:59</p>
</div>
</body>
</html>
